// Напишите программу, которая принимает на вход 
// число (А) и выдает сумму числе от 1 до (А)
// 7 -> 28
// 4 -> 10
// 8 -> 36


Console.Write("Введи число от 1 до 7: ");
int num = int.Parse(Console.ReadLine());